Белгипрозем_2017/src/Catalogs/мКарточкиОбъектовРабот/мКарточкиОбъектовРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мКарточкиОбъектовРабот</name>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <owners>Catalog.мОбъектыРабот</owners>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поручение</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Составил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакетДокументов</name>
    <type>
      <types>CatalogRef.мПакетыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарточки</name>
    <type>
      <types>EnumRef.мВариантыКарточекИсходныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредоставленияДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостоянияКарточекОбъектовРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПредоставления</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникФинансирования</name>
    <type>
      <types>CatalogRef.мИсточникиФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОбъекта</name>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Установлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ДокументЗаказчика</name>
      <type>
        <types>CatalogRef.мПакетыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредоставления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыДокумента</name>
    <attributes>
      <name>ДокументЗаказчика</name>
      <type>
        <types>CatalogRef.мПакетыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имеется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/мКарточкиОбъектовРабот/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтандартнаяОобработка = Ложь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
		// Заполнение шапки
		Заказчик = ДанныеЗаполнения.Отправитель;
		РасчетныйСчет = Заказчик.ОсновнойБанковскийСчет;
		Поручение = ДанныеЗаполнения.Ссылка;
        Если ЗначениеЗаполнено(Поручение) Тогда
            Наименование = Поручение.РегистрационныйНомер + " от "+ Формат(Поручение.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Заказчик = ДанныеЗаполнения.Заказчик;
		Поручение = ДанныеЗаполнения.Поручение;
        Если ЗначениеЗаполнено(Поручение) Тогда
            Наименование = Поручение.РегистрационныйНомер + " от "+ Формат(Поручение.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ВидРабот = ДанныеЗаполнения.ВидРабот;
		Владелец = ДанныеЗаполнения.ОбъектРабот;
	КонецЕсли;
	
КонецПроцедуры
